tests/trivial/jmeter.log
2019-03-08 13:41:45,111 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2019-03-08 13:41:45,136 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.1/bin/user.properties
2019-03-08 13:41:45,137 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.1/bin/system.properties
2019-03-08 13:41:45,138 INFO o.a.j.JMeter: Setting System property: log_level.jmeter=DEBUG
2019-03-08 13:41:45,138 INFO o.a.j.JMeter: Setting JMeter property: TARGET_HOST=www.map5.nl
2019-03-08 13:41:45,138 INFO o.a.j.JMeter: Setting JMeter property: TARGET_PORT=80
2019-03-08 13:41:45,139 INFO o.a.j.JMeter: Setting JMeter property: TARGET_PATH=/kaarten.html
2019-03-08 13:41:45,139 INFO o.a.j.JMeter: Setting JMeter property: TARGET_KEYWORD=Kaartdiensten
2019-03-08 13:41:45,145 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2019-03-08 13:41:45,147 INFO o.a.j.JMeter: Version 5.1 r1853635
2019-03-08 13:41:45,147 INFO o.a.j.JMeter: java.version=1.8.0_191
2019-03-08 13:41:45,148 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2019-03-08 13:41:45,148 INFO o.a.j.JMeter: os.name=Linux
2019-03-08 13:41:45,149 INFO o.a.j.JMeter: os.arch=amd64
2019-03-08 13:41:45,149 INFO o.a.j.JMeter: os.version=4.9.93-linuxkit-aufs
2019-03-08 13:41:45,149 INFO o.a.j.JMeter: file.encoding=UTF-8
2019-03-08 13:41:45,150 INFO o.a.j.JMeter: java.awt.headless=true
2019-03-08 13:41:45,150 INFO o.a.j.JMeter: Max memory     =192937984
2019-03-08 13:41:45,151 INFO o.a.j.JMeter: Available Processors =2
2019-03-08 13:41:45,157 INFO o.a.j.JMeter: Default Locale=English (EN)
2019-03-08 13:41:45,158 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2019-03-08 13:41:45,158 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.1
2019-03-08 13:41:45,159 INFO o.a.j.JMeter: user.dir  =/Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter
2019-03-08 13:41:45,160 INFO o.a.j.JMeter: PWD       =/Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter
2019-03-08 13:41:45,163 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: 9203bb231e5e FullName: 9203bb231e5e
2019-03-08 13:41:45,172 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter/tests/trivial/report'
2019-03-08 13:41:45,179 INFO o.a.j.s.FileServer: Default base='/Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter'
2019-03-08 13:41:45,185 INFO o.a.j.s.FileServer: Set new base='/Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter/tests/trivial'
2019-03-08 13:41:45,400 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2019-03-08 13:41:45,422 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2019-03-08 13:41:45,430 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2019-03-08 13:41:45,440 INFO o.a.j.s.SaveService: Loading file: tests/trivial/test-plan.jmx
2019-03-08 13:41:45,499 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-03-08 13:41:45,500 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-03-08 13:41:45,500 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-03-08 13:41:45,501 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-03-08 13:41:45,501 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2019-03-08 13:41:45,502 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2019-03-08 13:41:45,538 INFO o.a.j.JMeter: Creating summariser <summary>
2019-03-08 13:41:45,545 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2019-03-08 13:41:45,546 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: tests/trivial/test-plan.jtl
2019-03-08 13:41:45,547 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.1/bin/reportgenerator.properties
2019-03-08 13:41:45,548 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2019-03-08 13:41:45,553 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2019-03-08 13:41:45,556 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2019-03-08 13:41:45,557 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2019-03-08 13:41:45,557 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2019-03-08 13:41:45,558 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2019-03-08 13:41:45,558 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2019-03-08 13:41:45,559 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2019-03-08 13:41:45,559 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2019-03-08 13:41:45,560 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2019-03-08 13:41:45,564 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,565 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,566 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,566 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,566 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,567 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,567 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,568 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,568 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,569 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-03-08 13:41:45,570 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2019-03-08 13:41:45,571 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2019-03-08 13:41:45,572 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2019-03-08 13:41:45,573 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2019-03-08 13:41:45,576 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2019-03-08 13:41:45,577 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2019-03-08 13:41:45,595 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2019-03-08 13:41:45,597 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-03-08 13:41:45,598 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-03-08 13:41:45,610 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2019-03-08 13:41:45,611 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2019-03-08 13:41:46,077 INFO o.a.j.JMeter: Running test (1552052506077)
2019-03-08 13:41:46,122 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Scenario 1
2019-03-08 13:41:46,123 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Scenario 1.
2019-03-08 13:41:46,127 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-03-08 13:41:46,128 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=2 perThread=2000.0 delayedStart=false
2019-03-08 13:41:46,133 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2019-03-08 13:41:46,134 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2019-03-08 13:41:51,131 INFO o.a.j.t.JMeterThread: Thread started: Scenario 1 1-1
2019-03-08 13:41:51,154 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 9203bb231e5e
2019-03-08 13:41:51,162 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2019-03-08 13:41:51,164 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2019-03-08 13:41:51,165 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2019-03-08 13:41:51,165 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2019-03-08 13:41:51,165 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2019-03-08 13:41:51,335 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2019-03-08 13:41:51,342 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2019-03-08 13:41:51,343 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2019-03-08 13:41:51,426 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2019-03-08 13:41:51,434 INFO o.a.j.u.SSLManager: KeyStore created OK
2019-03-08 13:41:51,434 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2019-03-08 13:41:54,029 INFO o.a.j.t.JMeterThread: Thread is done: Scenario 1 1-1
2019-03-08 13:41:54,030 INFO o.a.j.t.JMeterThread: Thread finished: Scenario 1 1-1
2019-03-08 13:41:54,032 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2019-03-08 13:41:54,035 INFO o.a.j.r.Summariser: summary =      2 in 00:00:08 =    0.3/s Avg:   329 Min:   176 Max:   482 Err:     0 (0.00%)
2019-03-08 13:41:54,035 INFO o.a.j.JMeter: Generating Dashboard
2019-03-08 13:41:54,036 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2019-03-08 13:41:54,056 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2019-03-08 13:41:54,160 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2019-03-08 13:41:54,160 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2019-03-08 13:41:54,164 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2019-03-08 13:41:54,165 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2019-03-08 13:41:54,174 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2019-03-08 13:41:54,185 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2019-03-08 13:41:54,186 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2019-03-08 13:41:54,186 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2019-03-08 13:41:54,204 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2019-03-08 13:41:54,209 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2019-03-08 13:41:54,210 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2019-03-08 13:41:54,211 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2019-03-08 13:41:54,222 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2019-03-08 13:41:54,222 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 42 samples
2019-03-08 13:41:54,223 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2019-03-08 13:41:54,224 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2019-03-08 13:41:54,225 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2019-03-08 13:41:54,226 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2019-03-08 13:41:54,227 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2019-03-08 13:41:54,227 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2019-03-08 13:41:54,229 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2019-03-08 13:41:54,232 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2019-03-08 13:41:54,232 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2019-03-08 13:41:54,233 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2019-03-08 13:41:54,233 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 90 samples
2019-03-08 13:41:54,234 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 18 samples
2019-03-08 13:41:54,234 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 6 samples
2019-03-08 13:41:54,236 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 6 samples produced in 139ms on channel 0
2019-03-08 13:41:54,239 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2019-03-08 13:41:54,243 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2019-03-08 13:41:54,243 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2019-03-08 13:41:54,245 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2019-03-08 13:41:54,246 INFO o.a.j.r.d.JsonExporter: Checking output folder
2019-03-08 13:41:54,250 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter/tests/trivial/report/statistics.json
2019-03-08 13:41:54,515 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2019-03-08 13:41:54,523 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter/tests/trivial/report
2019-03-08 13:41:54,671 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter/tests/trivial/report, creating folder structure
2019-03-08 13:41:54,680 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/opt/apache-jmeter-5.1/bin/report-template' to '/Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter/tests/trivial/report', got message:[/Users/just/project/customers/kadaster/project/mfprint/work/jmeter/git.docker-jmeter/tests/trivial/report/statistics.json], found non empty folder with following content {}, will be ignored
2019-03-08 13:41:55,575 INFO o.a.j.JMeter: Dashboard generated